renesas/cpk_examples/cpk_ra8t2/dual_core_spi_screen_console_cpk_ra8t2_ep/e2studio_llvm/cm33/src/source/lcd/lcd_st7796u.c
/*============================ INCLUDES ======================================*/
#if !defined(__ARMCOMPILER_VERSION)
#include <byteswap.h>
#endif

#include "hal_data.h"
#include "lcd.h"
#include "r_sci_b_spi_cfg.h"

/*============================ MACROS ========================================*/

#define ST7796U_INTERFACE_8080_18BIT        0x00
#define ST7796U_INTERFACE_8080_09BIT        0x01
#define ST7796U_INTERFACE_8080_16BIT        0x02
#define ST7796U_INTERFACE_8080_08BIT        0x03
#define ST7796U_INTERFACE_3SPI              0x05
#define ST7796U_INTERFACE_MIPI              0x06
#define ST7796U_INTERFACE_4SPI              0x07
#define ST7796U_INTERFACE_RGB               0x10

#ifndef __ST7796U_INTERFACE
#define __ST7796U_INTERFACE     ST7796U_INTERFACE_MIPI
#endif

#ifndef __ST7796U_DEBUG
#define __ST7796U_DEBUG			0
#endif

#ifndef ST7796U_PIN_RESET
#define ST7796U_PIN_RESET		BSP_IO_PORT_00_PIN_13
#endif

#if __ST7796U_DEBUG
#include "utils/log.h"
#define UNLIKE_RETURN(v, t, msg, ...) if (v != t) { LOG_E(__FUNCTION__, msg, ##__VA_ARGS__); return; }
#else
#define UNLIKE_RETURN(v, t, msg, ...) if (v != t) { return; }
#endif

#if __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI

#ifndef ST7796U_4SPI_EN_CACHE
#define ST7796U_4SPI_EN_CACHE           1
#endif

#if ST7796U_4SPI_EN_CACHE

#ifndef ST7796U_4SPI_EN_DOUBLE_CACHE
/* NOTE: Unimplemented, don't use */
#define ST7796U_4SPI_EN_DOUBLE_CACHE    0
#endif

#ifndef ST7796U_CACHE_SIZE
#define ST7796U_CACHE_SIZE              (222 * 480 * 2)
#endif

#endif

#define DEFAULT_TIMEOUT     	200
#define ST7796U_SPI_INSTANCE	g_sci_spi8
#define ST7796U_SPI_CALLBACK	SCI8_SPI_Callback
#define ST7796U_SPI_HARD_CS		1
#define ST7796U_PIN_SPI_CLK		BSP_IO_PORT_13_PIN_01
#define ST7796U_PIN_SPI_MOSI	BSP_IO_PORT_13_PIN_02
#define ST7796U_PIN_SPI_MISO	BSP_IO_PORT_13_PIN_03
#define ST7796U_PIN_SPI_CS      BSP_IO_PORT_13_PIN_04
#define ST7796U_PIN_DCX         BSP_IO_PORT_13_PIN_05

#endif /* #if __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI */

/*============================ TYPES =========================================*/
#if __ST7796U_INTERFACE == ST7796U_INTERFACE_MIPI
typedef struct lcd_mipi_table_setting
{
    unsigned char size;
    unsigned char buffer[15];
    mipi_cmd_id_t cmd_id;
    mipi_dsi_cmd_flag_t flags;
} lcd_mipi_table_setting_t;
#elif __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI
typedef struct lcd_spi_table_setting {
    const uint8_t *cmd;
    uint8_t length;
    uint8_t val[16];
} lcd_spi_table_setting_t;

typedef enum lcd_spi_clk_select {
    SPI_CLK_READ,
    SPI_CLK_WRITE
} lcd_spi_clk_select_t;
#endif

/*============================ GLOBAL VARIABLES ==============================*/
/*============================ LOCAL VARIABLES ===============================*/
#if ST7796U_SPI_HARD_CS == 0
static uint8_t s_spi_sequence_end;
#endif

#if __ST7796U_INTERFACE == ST7796U_INTERFACE_MIPI
static uint8_t s_mipi_tx_done;
static uint8_t s_glcdc_vsync_flag;
/* This table of commands was adapted from sample code provided by FocusLCD
 * Page Link: https://focuslcds.com/product/4-5-tft-display-capacitive-tp-e45ra-mw276-c/
 * File Link: https://focuslcds.com/content/E45RA-MW276-C_init_code.txt */
static const lcd_mipi_table_setting_t sc_lcd_mipi_init_table[] = {
    {2, {0x11, 0x00}, MIPI_CMD_ID_DCS_SHORT_WRITE_0_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0xF0, 0xC3}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0xF0, 0x96}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0x36, 0x48}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0x3A, 0x55}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0xB4, 0x01}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {4, {0xB6, 0x8A, 0x07, 0x3B}, MIPI_CMD_ID_DCS_LONG_WRITE, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0xB7, 0xC6}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {3, {0xB9, 0x02, 0xE0}, MIPI_CMD_ID_DCS_LONG_WRITE, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {3, {0xC0, 0xC0, 0x64}, MIPI_CMD_ID_DCS_LONG_WRITE, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0xC1, 0x1D}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0xC2, 0xA7}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0xC5, 0x18}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {9, {0xE8, 0x40, 0x8A, 0x00, 0x00, 0x29, 0x19, 0xA5, 0x33}, MIPI_CMD_ID_DCS_LONG_WRITE, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {15, {0xE0, 0xF0, 0x0B, 0x12, 0x09, 0x0A, 0x26, 0x39, 0x54, 0x4E, 0x38, 0x13, 0x13, 0x2E, 0x34}, MIPI_CMD_ID_DCS_LONG_WRITE, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {15, {0xE1, 0xF0, 0x10, 0x15, 0x0D, 0x0C, 0x07, 0x38, 0x43, 0x4D, 0x3A, 0x16, 0x15, 0x30, 0x35}, MIPI_CMD_ID_DCS_LONG_WRITE, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0xF0, 0x3C}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0xF0, 0x69}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0x35, 0x00}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0x29, 0x00}, MIPI_CMD_ID_DCS_SHORT_WRITE_0_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0x21, 0x00}, MIPI_CMD_ID_DCS_SHORT_WRITE_0_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {5, {0x2A, 0x00, 0x31, 0x01, 0x0E}, MIPI_CMD_ID_DCS_LONG_WRITE, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {5, {0x2B, 0x00, 0x00, 0x01, 0xDF}, MIPI_CMD_ID_DCS_LONG_WRITE, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0x2C, 0x00}, MIPI_CMD_ID_DCS_SHORT_WRITE_0_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
};
#elif __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI

static uint8_t s_spi_transfer_done = 1;

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-const-variable"
#endif
/* Command Table 1 */
static const uint8_t sc_cmd_nop = 0x00;
static const uint8_t sc_cmd_swreset = 0x01;
static const uint8_t sc_cmd_rddid = 0x04;
static const uint8_t sc_cmd_read_num_of_dsi_err = 0x05;
static const uint8_t sc_cmd_rddst = 0x09;
static const uint8_t sc_cmd_rddpm = 0x0A;
static const uint8_t sc_cmd_rddmadctl = 0x0B;
static const uint8_t sc_cmd_rddcolmod = 0x0C;
static const uint8_t sc_cmd_rddim = 0x0D;
static const uint8_t sc_cmd_rddsm = 0x0E;
static const uint8_t sc_cmd_rddsdr = 0x0F;
static const uint8_t sc_cmd_slpin = 0x10;
static const uint8_t sc_cmd_slpout = 0x11;
static const uint8_t sc_cmd_ptlon = 0x12;
static const uint8_t sc_cmd_noron = 0x13;
static const uint8_t sc_cmd_invoff = 0x20;
static const uint8_t sc_cmd_invon = 0x21;
static const uint8_t sc_cmd_dispoff = 0x28;
static const uint8_t sc_cmd_dispon = 0x29;
static const uint8_t sc_cmd_caset = 0x2A;
static const uint8_t sc_cmd_raset = 0x2B;
static const uint8_t sc_cmd_ramwr = 0x2C;
static const uint8_t sc_cmd_ramrd = 0x2E;
static const uint8_t sc_cmd_ptlar = 0x30;
static const uint8_t sc_cmd_vscrdef = 0x33;
static const uint8_t sc_cmd_teoff = 0x34;
static const uint8_t sc_cmd_teon = 0x35;
static const uint8_t sc_cmd_madctl = 0x36;
static const uint8_t sc_cmd_vscsad = 0x37;
static const uint8_t sc_cmd_idmoff = 0x38;
static const uint8_t sc_cmd_idmon = 0x39;
static const uint8_t sc_cmd_colmod = 0x3A;
static const uint8_t sc_cmd_wrmemc = 0x3C;
static const uint8_t sc_cmd_rdmemc = 0x3E;
static const uint8_t sc_cmd_ste = 0x44;
static const uint8_t sc_cmd_gscan = 0x45;
static const uint8_t sc_cmd_wrdisbv = 0x51;
static const uint8_t sc_cmd_rddisbv = 0x52;
static const uint8_t sc_cmd_wrctrld = 0x53;
static const uint8_t sc_cmd_rdctrld = 0x54;
static const uint8_t sc_cmd_wrcabc = 0x55;
static const uint8_t sc_cmd_rdcabc = 0x56;
static const uint8_t sc_cmd_wrcabcmb = 0x5E;
static const uint8_t sc_cmd_rdcabcmb = 0x5F;
static const uint8_t sc_cmd_rdfcs = 0xAA;
static const uint8_t sc_cmd_rdcfcs = 0xAF;
static const uint8_t sc_cmd_rdid1 = 0xDA;
static const uint8_t sc_cmd_rdid2 = 0xDB;
static const uint8_t sc_cmd_rdid3 = 0xDC;
/* Command Table 2 */
static const uint8_t sc_cmd_ifmode = 0xB0;
static const uint8_t sc_cmd_frmctr1 = 0xB1;
static const uint8_t sc_cmd_frmctr2 = 0xB2;
static const uint8_t sc_cmd_frmctr3 = 0xB3;
static const uint8_t sc_cmd_dic = 0xB4;
static const uint8_t sc_cmd_bpc = 0xB6;
static const uint8_t sc_cmd_em = 0xB7;
static const uint8_t sc_cmd_modesel = 0xB9;
static const uint8_t sc_cmd_pwr1 = 0xC0;
static const uint8_t sc_cmd_pwr2 = 0xC1;
static const uint8_t sc_cmd_pwr3 = 0xC2;
static const uint8_t sc_cmd_vcmpctl = 0xC5;
static const uint8_t sc_cmd_vcm_offset = 0xC6;
static const uint8_t sc_cmd_nvmadw = 0xD0;
static const uint8_t sc_cmd_nvmbprog = 0xD1;
static const uint8_t sc_cmd_nvm_status_read = 0xD2;
static const uint8_t sc_cmd_rdid4 = 0xD3;
static const uint8_t sc_cmd_pgc = 0xE0;
static const uint8_t sc_cmd_ngc = 0xE1;
static const uint8_t sc_cmd_dgc1 = 0xE2;
static const uint8_t sc_cmd_dgc2 = 0xE3;
static const uint8_t sc_cmd_doca = 0xE8;
static const uint8_t sc_cmd_cscon = 0xF0;
static const uint8_t sc_cmd_spi_read_control = 0xFB;

