renesas/cpk_examples/cpk_ra8t2/dual_core_spi_screen_console_cpk_ra8t2_ep/e2studio_llvm/cm33/src/source/lcd/lcd_st7796u.c
/* If lcd_spi_table_setting_t::cmd is NULL, that means delay lcd_spi_table_setting_t::length ms */
static const lcd_spi_table_setting_t sc_lcd_setting_table[] = {
    {NULL           , 120, {0x00}},
    {&sc_cmd_slpout , 0  , {0x00}},
    {NULL           , 120, {0x00}},
    {&sc_cmd_cscon  , 1  , {0xC3}},
    {&sc_cmd_cscon  , 1  , {0x96}},
    {&sc_cmd_madctl , 1  , {0x48}},
    {&sc_cmd_colmod , 1  , {0x55}},
    {&sc_cmd_dic    , 1  , {0x01}},
    {&sc_cmd_bpc    , 3  , {0x8A, 0x07, 0x3B}},
    {&sc_cmd_em     , 1  , {0xC6}},
    {&sc_cmd_modesel, 2  , {0x02, 0xE0}},
    {&sc_cmd_pwr1   , 2  , {0xC0, 0x64}},
    {&sc_cmd_pwr2   , 1  , {0x1D}},
    {&sc_cmd_pwr3   , 1  , {0xA7}},
    {&sc_cmd_vcmpctl, 1  , {0x18}},
    {&sc_cmd_doca   , 8  , {0x40, 0x8A, 0x00, 0x00, 0x29, 0x19, 0xA5, 0x33}},
    {&sc_cmd_pgc    , 14 , {0xF0, 0x0B, 0x12, 0x09, 0x0A, 0x26, 0x39, 0x54, 0x4E, 0x38, 0x13, 0x13, 0x2E, 0x34}},
    {&sc_cmd_ngc    , 14 , {0xF0, 0x10, 0x15, 0x0D, 0x0C, 0x07, 0x38, 0x43, 0x4D, 0x3A, 0x16, 0x15, 0x30, 0x35}},
    {&sc_cmd_teon   , 1  , {0x00}},
    {&sc_cmd_invon  , 0  , {0x00}},
    {&sc_cmd_caset  , 4  , {0x00, 0x00, 0x01, 0x0E}},
    {&sc_cmd_raset  , 4  , {0x00, 0x00, 0x01, 0xDF}},
	{&sc_cmd_cscon  , 1  , {0x3C}},
    {&sc_cmd_cscon  , 1  , {0x69}},
	{&sc_cmd_dispon , 0  , {0x00}},
};
#if defined(__clang__)
#pragma clang diagnostic pop
#endif

/* When SCICLK is 120MHz, this config set SCI_SPI clock to 6MHz.
 * This clock config is for reading, must less then 6.66MHz */
static const sci_b_spi_extended_cfg_t sc_spi_read_clk_config = {
    .clk_div = { .cks = 0, .brr = 9, .bgdm = 1 },
    .clock_source = SCI_B_SPI_SOURCE_CLOCK_SCISPICLK
};

/* It will copy from FSP generation when call LCD_PortInit.
 * This clock config is for writing. */
static sci_b_spi_extended_cfg_t s_spi_write_clk_config;

#if ST7796U_4SPI_EN_CACHE
#if ST7796U_4SPI_EN_DOUBLE_CACHE
static uint8_t s_spi_frame_cache[2][ST7796U_CACHE_SIZE];
static uint8_t s_spi_frame_current;
#else
static uint8_t s_spi_frame_cache[1][ST7796U_CACHE_SIZE];
#endif
#endif

#endif /* #if __ST7796U_INTERFACE == ST7796U_INTERFACE_MIPI */

/*============================ PROTOTYPES ====================================*/
#pragma clang diagnostic ignored "-Wunused-function"

static void hardReset(void);

#if __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI
static void readMemory(uint8_t *val, uint32_t length);
static void readRegister(const uint8_t *reg, uint8_t *val, uint32_t length);
static void setClock(lcd_spi_clk_select_t select);
static void setCursor(LCD_Device *device, uint16_t x, uint16_t y);
static void setRenderArea(LCD_Device *device, uint16_t x, uint16_t y, uint16_t length, uint16_t width);
static void waitTransferDone(uint32_t timeout_ms);
static void writeMemory(const uint8_t *val, uint32_t length);
static void writeRegister(const uint8_t *reg, const uint8_t *val, uint32_t length);
#endif

/*============================ PUBLIC FUNCTIONS ==============================*/
uint32_t LCD_PortDrawBitmap(LCD_Device *device, uint16_t x, uint16_t y, uint16_t length, uint16_t width, const uint8_t *bitmap)
{
	uint16_t src_length = length;

	if ((length == 0) || (width == 0)) {
        return 0;
    }
	if ((x >= device->width) || (y >= device->high)) {
	#if __ST7796U_DEBUG
		LOG_W(__FUNCTION__, "[%u, %u] out of range", x, y);
	#endif
		return 1;
	}
	if ((x + length) > device->width) {
		length = device->width - x;
	}
	if ((y + width) > device->high) {
		width = device->high - y;
	}

#if __ST7796U_DEBUG
	LOG_D(__FUNCTION__, "x = %u, y = %u, length = %u, width = %u", x, y, length, width);
#endif

#if __ST7796U_INTERFACE == ST7796U_INTERFACE_MIPI
	(void)device;
	(void)x;
	(void)y;
	(void)length;
	(void)width;
	(void)bitmap;
#elif __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI
	uint16_t i, j;

	const uint16_t *p16_bitmap = (const uint16_t *)bitmap;

#if ST7796U_4SPI_EN_CACHE

	uint16_t *p16_cache = (uint16_t *)&s_spi_frame_cache[0];
	uint32_t index = x + y * device->width;

	for (i = 0; i < width; i++) {
		for (j = 0; j < length; j++) {
		#if defined(__ARMCOMPILER_VERSION)
			p16_cache[index + j] = p16_bitmap[i * src_length + j] >> 8;
			p16_cache[index + j] |= p16_bitmap[i * src_length + j] << 8;
		#else
			p16_cache[index + j] = bswap_16(p16_bitmap[i * src_length + j]);
		#endif
		}
		index += device->width;
	}

	setCursor(device, 0, y);
	writeRegister(&sc_cmd_ramwr, NULL, 0);
    waitTransferDone(DEFAULT_TIMEOUT);
#if ST7796U_SPI_HARD_CS == 0
    s_spi_sequence_end = 1;
#endif
    R_BSP_PinAccessEnable();
    R_BSP_PinWrite(ST7796U_PIN_DCX, BSP_IO_LEVEL_HIGH);
    R_BSP_PinWrite(ST7796U_PIN_SPI_CS, BSP_IO_LEVEL_LOW);
    R_SCI_B_SPI_Write(ST7796U_SPI_INSTANCE.p_ctrl, &p16_cache[y * device->width], width * device->width * 2, SPI_BIT_WIDTH_8_BITS);
#else
    uint16_t color;

    setRenderArea(device, x, y, length, width);
    writeRegister(&sc_cmd_ramwr, NULL, 0);
    waitTransferDone(DEFAULT_TIMEOUT);
    R_BSP_PinAccessEnable();
    R_BSP_PinWrite(ST7796U_PIN_DCX, BSP_IO_LEVEL_HIGH);
    R_BSP_PinWrite(ST7796U_PIN_SPI_CS, BSP_IO_LEVEL_LOW);
    for (i = 0; i < width; i++) {
    	for (j = 0; j < length; j++) {
		#if defined(__ARMCOMPILER_VERSION)
			color = p16_bitmap[i * src_length + j] >> 8;
			color |= p16_bitmap[i * src_length + j] << 8;
		#else
			color = bswap_16(p16_bitmap[i * src_length + j]);
		#endif
			R_SCI_B_SPI_Write(ST7796U_SPI_INSTANCE.p_ctrl, &color, 2, SPI_BIT_WIDTH_8_BITS);
			waitTransferDone(DEFAULT_TIMEOUT);
    	}
    }
    R_BSP_PinWrite(ST7796U_PIN_SPI_CS, BSP_IO_LEVEL_HIGH);
#endif

#endif
	return 0;
}

uint32_t LCD_PortDrawPoint(LCD_Device *device, uint16_t x, uint16_t y, uint32_t color)
{
	if ((x >= device->width) || (y >= device->high)) {
		return 1;
	}

#if __ST7796U_INTERFACE == ST7796U_INTERFACE_MIPI
	(void)device;
	(void)x;
	(void)y;
	(void)color;
#elif __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI

#if ST7796U_4SPI_EN_CACHE
	uint16_t *p16_cache = NULL;
	uint32_t *p32_cache = NULL;
	uint32_t index = x + y * device->width;

