renesas/cpk_examples/cpk_ra8t2/dual_core_spi_screen_console_cpk_ra8t2_ep/e2studio_llvm/cm33/src/source/lcd/lcd_st7796u.c
    return 0;
}

uint32_t LCD_PortSetOrientation(LCD_Device *device, LCD_ScreenOrientation orientation)
{
#if __ST7796U_INTERFACE == ST7796U_INTERFACE_MIPI
	(void)device;
	(void)orientation;
#elif __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI
	uint8_t data_write[4];

#if __ST7796U_DEBUG
	LOG_D(__FUNCTION__, "Change orientation to %d", orientation);
#endif
	waitTransferDone(DEFAULT_TIMEOUT);
	if (orientation == SCREEN_ORIENTATION_HORIZONTAL) {
		data_write[0] = 0x28;
		writeRegister(&sc_cmd_madctl, data_write, 1);
		waitTransferDone(DEFAULT_TIMEOUT);
		data_write[0] = 0x00;
		data_write[1] = 0x00;
		data_write[2] = 0x01;
		data_write[3] = 0xDF;
		writeRegister(&sc_cmd_caset, data_write, 4);
		waitTransferDone(DEFAULT_TIMEOUT);
		data_write[2] = 0x01;
		data_write[3] = 0x0E;
		writeRegister(&sc_cmd_raset, data_write, 4);
		waitTransferDone(DEFAULT_TIMEOUT);
		device->high = 222;
		device->width = 480;
	}
	else if (orientation == SCREEN_ORIENTATION_HORIZONTAL_FLIP) {
		data_write[0] = 0xE8;
		writeRegister(&sc_cmd_madctl, data_write, 1);
		waitTransferDone(DEFAULT_TIMEOUT);
		data_write[0] = 0x00;
		data_write[1] = 0x00;
		data_write[2] = 0x01;
		data_write[3] = 0xDF;
		writeRegister(&sc_cmd_caset, data_write, 4);
		waitTransferDone(DEFAULT_TIMEOUT);
		data_write[2] = 0x01;
		data_write[3] = 0x0E;
		writeRegister(&sc_cmd_raset, data_write, 4);
		waitTransferDone(DEFAULT_TIMEOUT);
		device->high = 222;
		device->width = 480;
	}
	else if (orientation == SCREEN_ORIENTATION_VERTICAL) {
		data_write[0] = 0x48;
		writeRegister(&sc_cmd_madctl, data_write, 1);
		waitTransferDone(DEFAULT_TIMEOUT);
		data_write[0] = 0x00;
		data_write[1] = 0x00;
		data_write[2] = 0x01;
		data_write[3] = 0x0E;
		writeRegister(&sc_cmd_caset, data_write, 4);
		waitTransferDone(DEFAULT_TIMEOUT);
		data_write[2] = 0x01;
		data_write[3] = 0xDF;
		writeRegister(&sc_cmd_caset, data_write, 4);
		waitTransferDone(DEFAULT_TIMEOUT);
		device->high = 480;
		device->width = 222;
	}
	else {
		data_write[0] = 0x88;
		writeRegister(&sc_cmd_madctl, data_write, 1);
		waitTransferDone(DEFAULT_TIMEOUT);
		data_write[0] = 0x00;
		data_write[1] = 0x00;
		data_write[2] = 0x01;
		data_write[3] = 0x0E;
		writeRegister(&sc_cmd_caset, data_write, 4);
		waitTransferDone(DEFAULT_TIMEOUT);
		data_write[2] = 0x01;
		data_write[3] = 0xDF;
		writeRegister(&sc_cmd_caset, data_write, 4);
		waitTransferDone(DEFAULT_TIMEOUT);
		device->high = 480;
		device->width = 222;
	}
	device->orientation = orientation;
#endif

	return 0;
}

/*============================ LOCAL FUNCTIONS ===============================*/
static void hardReset(void)
{
    R_BSP_PinAccessEnable();
    R_IOPORT_PinWrite(&g_ioport_ctrl, ST7796U_PIN_RESET, BSP_IO_LEVEL_HIGH);
    R_BSP_SoftwareDelay(100, BSP_DELAY_UNITS_MILLISECONDS);
    R_IOPORT_PinWrite(&g_ioport_ctrl, ST7796U_PIN_RESET, BSP_IO_LEVEL_LOW);
    R_BSP_SoftwareDelay(1, BSP_DELAY_UNITS_MICROSECONDS);
    R_IOPORT_PinWrite(&g_ioport_ctrl, ST7796U_PIN_RESET, BSP_IO_LEVEL_HIGH);
    R_BSP_SoftwareDelay(4, BSP_DELAY_UNITS_MILLISECONDS);
    R_IOPORT_PinWrite(&g_ioport_ctrl, ST7796U_PIN_RESET, BSP_IO_LEVEL_LOW);
    R_BSP_SoftwareDelay(5, BSP_DELAY_UNITS_MILLISECONDS);
    R_IOPORT_PinWrite(&g_ioport_ctrl, ST7796U_PIN_RESET, BSP_IO_LEVEL_HIGH);
}

#if __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI
static void readMemory(uint8_t *val, uint32_t length)
{
    fsp_err_t err;

    /* Wait last transfer done */
    waitTransferDone(DEFAULT_TIMEOUT);

    R_BSP_PinAccessEnable();
    R_BSP_PinWrite(ST7796U_PIN_SPI_CS, BSP_IO_LEVEL_LOW);
    R_BSP_PinWrite(ST7796U_PIN_DCX, BSP_IO_LEVEL_LOW);
    setClock(SPI_CLK_WRITE);
    s_spi_transfer_done = 0;
    err = R_SCI_B_SPI_Write(ST7796U_SPI_INSTANCE.p_ctrl, &sc_cmd_ramrd, 1, SPI_BIT_WIDTH_8_BITS);
    UNLIKE_RETURN(err, FSP_SUCCESS, "Write command failed: 0x%X", err);
    waitTransferDone(DEFAULT_TIMEOUT);
    R_BSP_PinWrite(ST7796U_PIN_DCX, BSP_IO_LEVEL_HIGH);
    /* Set flag, interrupt callback can driver CS to high when spi transfer complete */
#if ST7796U_SPI_HARD_CS == 0
    s_spi_sequence_end = 1;
#endif
    setClock(SPI_CLK_READ);
    s_spi_transfer_done = 0;
    err = R_SCI_B_SPI_Read(ST7796U_SPI_INSTANCE.p_ctrl, val, length, SPI_BIT_WIDTH_8_BITS);
    UNLIKE_RETURN(err, FSP_SUCCESS, "Read API failed: 0x%X", err);
}

static void readRegister(const uint8_t *reg, uint8_t *val, uint32_t length)
{
    fsp_err_t err;

    /* Wait last transfer done */
    waitTransferDone(DEFAULT_TIMEOUT);
#if ST7796U_SPI_HARD_CS == 0
    /* Clear flag, start a spi transfer squence */
    s_spi_sequence_end = 0;
#endif

    R_BSP_PinAccessEnable();
    R_BSP_PinWrite(ST7796U_PIN_DCX, BSP_IO_LEVEL_LOW);
    R_BSP_PinWrite(ST7796U_PIN_SPI_CS, BSP_IO_LEVEL_LOW);
    setClock(SPI_CLK_WRITE);
    s_spi_transfer_done = 0;
    err = R_SCI_B_SPI_Write(ST7796U_SPI_INSTANCE.p_ctrl, reg, 1, SPI_BIT_WIDTH_8_BITS);
    UNLIKE_RETURN(err, FSP_SUCCESS, "Write command failed: 0x%X", err);
    waitTransferDone(DEFAULT_TIMEOUT);
    R_BSP_PinWrite(ST7796U_PIN_DCX, BSP_IO_LEVEL_HIGH);
#if ST7796U_SPI_HARD_CS == 0
    /* Set flag, interrupt callback can driver CS to high when spi transfer complete */
    s_spi_sequence_end = 1;
#endif
    setClock(SPI_CLK_READ);
    s_spi_transfer_done = 0;
    err = R_SCI_B_SPI_Read(ST7796U_SPI_INSTANCE.p_ctrl, val, length, SPI_BIT_WIDTH_8_BITS);
    UNLIKE_RETURN(err, FSP_SUCCESS, "Read API failed: 0x%X", err);
}

/**
 * @brief   Switch SPI clock. ST7796U has different maximum clock when reading and writing.
 * @param   select SPI_CLK_READ: Switch to slow clock. SPI_CLK_WRITE: Switch to fast clock.
 */
static void setClock(lcd_spi_clk_select_t select)
{
    const sci_b_spi_extended_cfg_t *p_cfg;
    R_SCI_B0_Type *p_reg = ((sci_b_spi_instance_ctrl_t *)ST7796U_SPI_INSTANCE.p_ctrl)->p_reg;

    if (select == SPI_CLK_READ) {
        p_cfg = &sc_spi_read_clk_config;
    }
    else {
        p_cfg = &s_spi_write_clk_config;
    }

    if ((p_reg->CCR2_b.CKS != p_cfg->clk_div.cks) ||
        (p_reg->CCR2_b.BRR != p_cfg->clk_div.brr) ||
        (p_reg->CCR2_b.BGDM != p_cfg->clk_div.bgdm) ||
        (p_reg->CCR3_b.BPEN != p_cfg->clock_source)) {
        waitTransferDone(DEFAULT_TIMEOUT);
        R_BSP_SoftwareDelay(20, BSP_DELAY_UNITS_MICROSECONDS);
        p_reg->CCR2_b.CKS = p_cfg->clk_div.cks;
        p_reg->CCR2_b.BRR = p_cfg->clk_div.brr;
        p_reg->CCR2_b.BGDM = p_cfg->clk_div.bgdm;
        p_reg->CCR3_b.BPEN = p_cfg->clock_source;
        R_BSP_SoftwareDelay(20, BSP_DELAY_UNITS_MICROSECONDS);
    }
}

static void setCursor(LCD_Device *device, uint16_t x, uint16_t y)
{
	uint8_t data_write[2];

    if ((device->orientation == SCREEN_ORIENTATION_HORIZONTAL) || (device->orientation == SCREEN_ORIENTATION_HORIZONTAL_FLIP)) {
        y += 0x31;
    }
    else {
        x += 0x31;
    }

	data_write[0] = x >> 8;
	data_write[1] = (uint8_t)x;
	writeRegister(&sc_cmd_caset, data_write, 2);
	waitTransferDone(DEFAULT_TIMEOUT);
	data_write[0] = y >> 8;
	data_write[1] = (uint8_t)y;
	writeRegister(&sc_cmd_raset, data_write, 2);
	waitTransferDone(DEFAULT_TIMEOUT);
}

static void setRenderArea(LCD_Device *device, uint16_t x, uint16_t y, uint16_t length, uint16_t width)
{
	uint8_t data_write[4];

	if ((device->orientation == SCREEN_ORIENTATION_HORIZONTAL) || (device->orientation == SCREEN_ORIENTATION_HORIZONTAL_FLIP)) {
        y += 0x31;
    }
    else {
        x += 0x31;
    }

	data_write[0] = x >> 8;
	data_write[1] = (uint8_t)x;
	data_write[2] = (x + length - 1) >> 8;
	data_write[3] = (uint8_t)(x + length - 1);
	writeRegister(&sc_cmd_caset, data_write, 4);
	waitTransferDone(DEFAULT_TIMEOUT);
	data_write[0] = y >> 8;
	data_write[1] = (uint8_t)y;
	data_write[2] = (y + width - 1) >> 8;
	data_write[3] = (uint8_t)(y + width - 1);
	writeRegister(&sc_cmd_raset, data_write, 4);
	waitTransferDone(DEFAULT_TIMEOUT);
}

static void waitTransferDone(uint32_t timeout_ms)
{
    volatile uint32_t us = timeout_ms * 1000;
    sci_b_spi_instance_ctrl_t *p_ctrl = ST7796U_SPI_INSTANCE.p_ctrl;

    /* This seems does't work correctly */
    while (us) {
    	if (s_spi_transfer_done == 0) {
    		R_BSP_SoftwareDelay(1, BSP_DELAY_UNITS_MICROSECONDS);
    		us--;
    	}
    	else {
    		us = 0;
    	}
    }

    while (us) {
        if ((p_ctrl->p_reg->CCR0 & (R_SCI_B0_CCR0_RE_Msk | R_SCI_B0_CCR0_TE_Msk)) != 0) {
            R_BSP_SoftwareDelay(1, BSP_DELAY_UNITS_MICROSECONDS);
            us--;
        }
        else {
            us = 0;
        }
    }
}

static void writeMemory(const uint8_t *val, uint32_t length)
{
    fsp_err_t err;

    /* Wait last transfer done */
    waitTransferDone(DEFAULT_TIMEOUT);
#if ST7796U_SPI_HARD_CS == 0
    /* Clear flag, start a spi transfer squence */
    s_spi_sequence_end = 0;
#endif

    R_BSP_PinAccessEnable();
    R_BSP_PinWrite(ST7796U_PIN_DCX, BSP_IO_LEVEL_LOW);
    R_BSP_PinWrite(ST7796U_PIN_SPI_CS, BSP_IO_LEVEL_LOW);
    setClock(SPI_CLK_WRITE);
    s_spi_transfer_done = 0;
    err = R_SCI_B_SPI_Write(ST7796U_SPI_INSTANCE.p_ctrl, &sc_cmd_ramwr, 1, SPI_BIT_WIDTH_8_BITS);
    UNLIKE_RETURN(err, FSP_SUCCESS, "Write command failed: 0x%X", err);
    waitTransferDone(DEFAULT_TIMEOUT);
    R_BSP_PinWrite(ST7796U_PIN_DCX, BSP_IO_LEVEL_HIGH);
#if ST7796U_SPI_HARD_CS == 0
    /* Set flag, interrupt callback can driver CS to high when spi transfer complete */
    s_spi_sequence_end = 1;
#endif
    setClock(SPI_CLK_WRITE);
    s_spi_transfer_done = 0;
    err = R_SCI_B_SPI_Write(ST7796U_SPI_INSTANCE.p_ctrl, val, length, SPI_BIT_WIDTH_8_BITS);
    UNLIKE_RETURN(err, FSP_SUCCESS, "Read API failed: 0x%X", err);
}

static void writeRegister(const uint8_t *reg, const uint8_t *val, uint32_t length)
{
    fsp_err_t err;

    /* Wait last transfer done */
    waitTransferDone(DEFAULT_TIMEOUT);
#if ST7796U_SPI_HARD_CS == 0
    /* Clear flag, start a spi transfer squence */
    s_spi_sequence_end = 0;
#endif

    R_BSP_PinAccessEnable();
    R_BSP_PinWrite(ST7796U_PIN_DCX, BSP_IO_LEVEL_LOW);
    R_BSP_PinWrite(ST7796U_PIN_SPI_CS, BSP_IO_LEVEL_LOW);
    setClock(SPI_CLK_WRITE);
    s_spi_transfer_done = 0;
    err = R_SCI_B_SPI_Write(ST7796U_SPI_INSTANCE.p_ctrl, reg, 1, SPI_BIT_WIDTH_8_BITS);
    UNLIKE_RETURN(err, FSP_SUCCESS, "Write command failed: 0x%X", err);
    waitTransferDone(DEFAULT_TIMEOUT);
#if ST7796U_SPI_HARD_CS == 0
    /* Set flag, interrupt callback can driver CS to high when spi transfer complete */
    s_spi_sequence_end = 1;
#endif
    if ((val != NULL) && (length != 0)) {
        R_BSP_PinWrite(ST7796U_PIN_DCX, BSP_IO_LEVEL_HIGH);
        setClock(SPI_CLK_WRITE);
        s_spi_transfer_done = 0;
        err = R_SCI_B_SPI_Write(ST7796U_SPI_INSTANCE.p_ctrl, val, length, SPI_BIT_WIDTH_8_BITS);
        UNLIKE_RETURN(err, FSP_SUCCESS, "Read API failed: 0x%X", err);
    }
    else {
        R_BSP_PinWrite(ST7796U_PIN_SPI_CS, BSP_IO_LEVEL_HIGH);
    }
}
#endif /* #if __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI */

/*============================ IMPLEMENTATION ================================*/
#if __ST7796U_INTERFACE == ST7796U_INTERFACE_MIPI
void GLCDC_Callback(display_callback_args_t *p_args)
{
    if (p_args->event == DISPLAY_EVENT_LINE_DETECTION) {
        s_glcdc_vsync_flag = 1;
    }
}

void MIPI_DSI_Callback(mipi_dsi_callback_args_t *p_args)
{
    if (p_args->event == MIPI_DSI_EVENT_SEQUENCE_0) {
        if (p_args->tx_status == MIPI_DSI_SEQUENCE_STATUS_DESCRIPTORS_FINISHED) {
            s_mipi_tx_done = 1;
        }
    }
}

#elif __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI
void ST7796U_SPI_CALLBACK(spi_callback_args_t *p_args)
{
    if (p_args->event == SPI_EVENT_TRANSFER_COMPLETE) {
    	s_spi_transfer_done = 1;
    #if ST7796U_SPI_HARD_CS == 0
        if (s_spi_sequence_end) {
            R_BSP_PinWrite(ST7796U_PIN_SPI_CS, BSP_IO_LEVEL_HIGH);
        }
    #endif
    }
    else {
        if (p_args->event == SPI_EVENT_TRANSFER_ABORTED) {
        #if __ST7796U_DEBUG
            LOG_W(__FUNCTION__, "Abort");
        #endif
        }
        else {
        #if __ST7796U_DEBUG
            LOG_E(__FUNCTION__, "Event: %d", p_args->event);
        #endif
        }
    }
}
#endif /* #if __ST7796U_INTERFACE == ST7796U_INTERFACE_MIPI */
